Revit 2027 API
ParameterTypeId.BendingDetailSegmentLengthDimensionTextPosition Property
 "Dimension Text Position"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BendingDetailSegmentLengthDimensionTextPosition { get; }
Public Shared ReadOnly Property BendingDetailSegmentLengthDimensionTextPosition As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BendingDetailSegmentLengthDimensionTextPosition {
	ForgeTypeId^ get ();
}
static member BendingDetailSegmentLengthDimensionTextPosition : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace